<!-- Проверка на количество элементов в массиве
 <?php
	$arr = [1, 2, 3, 4, 5];
    if (count($arr) == 3){
       echo $res = $arr[0] + $arr[1] +$arr[2];
    } else {
        if (count($arr) < 3) {
            echo 'В массиве меньше 3 элементов';
        } else {
            echo 'В массиве больше 3 элементов';
        }
    }
?> 
-->

<!-- Проверка на равенство последнего числа
<?php
	$str = '123450';
	$last = $str[strlen($str) - 1];
	
	if ($last == 0) {
		echo '0';
	}
?>
-->

<!-- Проверка четное или не четное число
<?php
	$number = 6;
    $res = $number % 2;
    if ($res == 0){
        echo "Число $number четное";
    } else {
        echo "Число $number не четное";
    }
?>
-->

<!-- Проверка что число делится на 3
<?php
	$number = 12;
    $res = $number % 3;
    if ($res == 0){
        echo "Число $number делится на 3";
    } else {
        echo "Число $number не делится на 3";
    }
?>
-->
<!-- Проверьте, что первым символом этой строки является буква 'a'.
<?php
    $str = 'cabcde';
    if ($str[0] == 'a') {
        echo "Первый символ строки 'a'";
    } else {
        echo "FALSE";
    }
?>
-->

<!-- Дано число, например, 12345. Проверьте, что первым символом этого числа является цифра 1, 2 или 3.
<?php
    $str = 45;
    $str = (string)$str;
    if (isset($str[0]) and isset($str[1]) and isset($str[2])){
        if ($str[0] == 1 or $str[1] == 2 or $str[2] == 3) {
            echo "Первый символ строки цифра 1, 2 или 3";
        } 
    } else {
        echo "В строке меньше 3 символов";
    }

?> -->

<!-- Дано трехзначное число. Найдите сумму цифр этого числа.
<?php
    $numbers = 123;
    $numbers = (string)$numbers;
    $res = $numbers[0] + $numbers[1] + $numbers[2];
    echo $res;
?> -->
