<!-- Проверка на количество элементов в массиве
 <?php
	$arr = [1, 2, 3, 4, 5];
    if (count($arr) == 3){
       echo $res = $arr[0] + $arr[1] +$arr[2];
    } else {
        if (count($arr) < 3) {
            echo 'В массиве меньше 3 элементов';
        } else {
            echo 'В массиве больше 3 элементов';
        }
    }
?> 
-->

<!-- Проверка на равенство последнего числа
<?php
	$str = '123450';
	$last = $str[strlen($str) - 1];
	
	if ($last == 0) {
		echo '0';
	}
?>
-->

<!-- Проверка четное или не четное число
<?php
	$number = 6;
    $res = $number % 2;
    if ($res == 0){
        echo "Число $number четное";
    } else {
        echo "Число $number не четное";
    }
?>
-->

<!-- Проверка что число делится на 3
<?php
	$number = 12;
    $res = $number % 3;
    if ($res == 0){
        echo "Число $number делится на 3";
    } else {
        echo "Число $number не делится на 3";
    }
?>
-->
<!-- Проверьте, что первым символом этой строки является буква 'a'.
<?php
    $str = 'cabcde';
    if ($str[0] == 'a') {
        echo "Первый символ строки 'a'";
    } else {
        echo "FALSE";
    }
?>
-->

<!-- Дано число, например, 12345. Проверьте, что первым символом этого числа является цифра 1, 2 или 3.
<?php
    $str = 45;
    $str = (string)$str;
    if (isset($str[0]) and isset($str[1]) and isset($str[2])){
        if ($str[0] == 1 or $str[1] == 2 or $str[2] == 3) {
            echo "Первый символ строки цифра 1, 2 или 3";
        } 
    } else {
        echo "В строке меньше 3 символов";
    }

?> -->

<!-- Дано трехзначное число. Найдите сумму цифр этого числа.
<?php
    $numbers = 123;
    $numbers = (string)$numbers;
    $res = $numbers[0] + $numbers[1] + $numbers[2];
    echo $res;
?> -->

<!-- Дано число из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. <br>
<?php
    $number = 871871;
    $number = (string)$number;

    $sum1 = $number[0] + $number[1] + $number[2];
    $sum2 = $number[3] + $number[4] + $number[5];

    if($sum1 == $sum2) {
        echo "сумма первых трех цифр равняется сумме вторых трех цифр";
    } else {
        echo "сумма первых трех цифр не равняется сумме вторых трех цифр";
    };
?>  -->

<!-- Дан массив. Выведите столбец элементов этого массива на экран.
<?php
	$arr = ['a', 'b', 'c', 'd', 'e'];

    foreach ($arr as $elem) {
        echo $elem . '<br>';
    };
?> -->

<!-- Дан массив. Найдите сумму элементов этого массива и выведите ее на экран.
<?php
	$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
    $res = 0;

    foreach ($arr as $elem) {
        $res = $res + $elem;
        // $res += $elem;
    }

    echo $res;
?> -->

<!-- Дан массив. Найдите среднее арифметическое его элементов.
<?php
	$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
    $res = 0;
    $sum = count($arr);
    foreach ($arr as $elem) {
        $res += $elem;
    };

    echo $res / $sum;
?> -->

<!-- Дан массив. С помощью цикла foreach выведите на экран столбец ключей и элементов в формате green - зеленый.
<?php
	$arr = ['green' => 'зеленый', 'red' => 'красный','blue' => 'голубой'];

    foreach ($arr as $key => $elem) {
        echo $key . '-' . $elem . '<br>';
    };
?> -->

<!-- Дан массив. С помощью цикла foreach выведите на экран столбец строк такого формата: user1 - возраст 30 лет.
<?php
	$arr = ['user1' => 30, 'user2' => 32, 'user3' => 33];
    foreach ($arr as $key => $elem) {
        echo $key . ' - возраст ' . $elem . ' лет. <br>';
    }
?> -->

<!-- С помощью цикла foreach и оператора if выведите в консоль нечетные элементы массива.
<?php
	$arr = [1, 2, 3, 4, 5];
    foreach ($arr as $elem) {
        if ($elem % 2 !== 0) {
            echo $elem . '<br>';
        };
    };
?> -->

<!-- С помощью цикла foreach и оператора if выведите в консоль те элементы массива, которые больше 3-х, но меньше 10.
<?php
	$arr = [2, 5, 9, 15, 1, 4];
    foreach ($arr as $elem) {
        if ($elem > 3 and $elem < 10) {
            echo $elem . '<br>';
        }
    }
?> -->

<!-- Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.
<?php
    $arr = [4, 5, 1, -10, 457, 345, -45, -213, 54, 6, 9, -7];
    $res = 0;
    foreach ($arr as $elem) {
        if ($elem > 0) {
            $res += $elem;
        };
    };
    echo $res;
?> -->

<!-- Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.
<?php
	$arr = [10, 20, 30, 50, 235, 3000, 245, 6585, 745, 545436, 143214, 24325, 1, 2, 5, 6, 7];
    foreach ($arr as $elem) {
        $elem = (string)$elem;
        if ($elem[0] == 1 or $elem[0] == 2 or $elem[0] == 5) {
            echo $elem . '<br>';
        }
    }
?> -->

<!-- Составьте массив дней недели. С помощью цикла foreach выведите все дни недели, а выходные дни выведите жирным.
<?php   
    $dayWeek = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
    foreach ($dayWeek as $key => $elem) {
        if ($key < 5) {
            echo $elem . '<br>';
        } else {
            echo '<b>' . $elem . '</b> <br>';
        }
    }
?> -->

<!-- Составьте массив дней недели. С помощью цикла foreach выведите все дни недели, а текущий день выведите курсивом. 
Номер текущего дня должен храниться в переменной $day.
<?php
    $dayWeek = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
    $day = 'Среда';
    foreach ($dayWeek as $elem) {
        if ($elem !== $day) {
            echo $elem . '<br>';
        } else {
            echo '<b>' . $elem . '</b> <br>';
        }
    }
?> -->

<!-- Выведите на экран числа от 1 до 100.
<?php
    $i = 1;
    while ($i <= 100) {
        echo $i . '<br>';
        $i++;
    }
?> -->

<!-- Выведите на экран числа 11 до 33.
<?php
    $i = 11;
    while ($i <= 33) {
        echo $i . '<br>';
        $i++;
    }
?> -->

<!-- Выведите на экран четные числа в промежутке от 0 до 100.
<?php
    $i = 2;
    while ($i <= 100) {
        echo $i . '<br>';
        $i += 2;
    }
?> -->

<!-- Выведите на экран нечетные числа в промежутке от 1 до 99.
<?php
    $i = 1;
    while ($i <= 100) {
        echo $i . '<br>';
        $i += 2;
    }
?> -->

<!-- Выведите на экран числа от 30 до 0.
<?php
    $i = 30;
    while ($i >= 0) {
        echo $i . '<br>';
        $i--;
    }
?>  -->

<!-- С помощью цикла for выведите на экран числа от 1 до 100.
<?php
	for ($i = 1; $i <= 100; $i++) {
		echo $i . '<br>';
	}
?> -->

<!-- С помощью цикла for выведите на экран числа от 11 до 33.
<?php
	for ($i = 11; $i <= 33; $i++) {
		echo $i . '<br>';
	}
?> -->

<!-- С помощью цикла for выведите на экран четные числа в промежутке от 0 до 100.
<?php
	for ($i = 0; $i <= 100; $i += 2) {
		echo $i . '<br>';
	}
?>  -->

<!-- С помощью цикла for выведите на экран нечетные числа в промежутке от 1 до 99.
<?php
	for ($i = 1; $i <= 100; $i += 2) {
		echo $i . '<br>';
	}
?> -->

<!-- С помощью цикла for выведите на экран числа от 100 до 0.
<?php
	for ($i = 100; $i >= 0; $i--) {
		echo $i . '<br>';
	}
?> -->

<!-- Найдите произведение целых чисел от 1 до 20.
<?php
	$res = 0;
    for ($i = 1; $i <= 20; $i++) {
        $res += $i;
    }
    echo $res . '<br>';
?> -->

<!-- Найдите сумму четных чисел от 2 до 100.
<?php
	$res = 0;
    for ($i = 2; $i <= 100; $i += 2) {
        $res += $i;
    }
    echo $res . '<br>';
?> -->

<!-- Найдите сумму нечетных чисел от 1 до 99.
<?php
	$res = 0;
    for ($i = 1; $i <= 100; $i += 2) {
        $res += $i;
    }
    echo $res . '<br>';
?>  -->

<!-- Дан массив с числами. Запустите цикл, который будет по очереди выводить элементы этого массива в консоль до тех пор, 
пока не встретится элемент со значением 0. После этого цикл должен завершить свою работу.
<?php
    $arr = [1, 2, 3, 4, 5, 6, 345, 64, 24, 64, 672, 0, 5, 32, 54, 65, 8, 9];
    foreach ($arr as $elem) {
        if ($elem == 0) {
            break;
        }
        echo $elem . '<br>';
    }
?> -->

<!-- Дан массив с числами. Найдите сумму элементов, расположенных от начала массива до первого отрицательного числа.
<?php
    $arr = [1, 2, 3, 4, 5, 6, 345, 64, 24, 64, 672, 0, -1, 5, 32, 54, 65, 8, 9];
    $res = 0;
    foreach ($arr as $elem) {
        if ($elem < 0) {
            break;
        };
        $res += $elem;
    }
    echo $res . '<br>';
?> -->

<!-- Дан массив с числами. Найдите позицию первого числа 3 в этом массиве (считаем, что это число обязательно есть в массиве). 
<?php
    $arr = [1, 2, 33, 4, 5, 6, 345, 64, 24, 64, 672, 3, 0, -1, 5, 32, 54, 3, 65, 8, 9];
    $position = 0;
    foreach ($arr as $key => $elem) {
        if ($elem == 3) {
            $position = $key;
            break;
        };
    }
    echo $position . '<br>';
?> -->

<!-- Определите, сколько целых чисел, начиная с числа 1, нужно сложить, чтобы сумма получилась больше 100.
<?php
    $sum = 0;
    $count = 0;
    while ($sum < 100) {
        $count++;
        echo $count;
        $sum += $count;
        echo $sum . '<br>';
    }
    echo "Для получения суммы больше 100 необходимо сложить $count чисел.";
?> -->

<!-- Проверьте, что в этом массиве есть элемент 'c'. Если есть - выведите 'да', а если нет - выведите 'нет'.
<?php
	$arr = ['a', 'b', 'c', 'd', 'e'];
    $flag = false;
    foreach ($arr as $elem) {
        if ($elem == 'c') {
            $flag = true;
        }
    }
    if ($flag) {
        echo 'есть';
    } else {
        echo 'нет';
    }
?> -->

<!-- Дано число $num с неким начальным значением. Умножайте его на 3 столько раз, пока результат умножения не станет больше 1000. 
Какое число получится? Посчитайте количество итераций, необходимых для этого.
<?php
	$num = 100;
	$count = 0;
	while ($num < 1000) {
        $count++;
        $num = $num * 3;
        echo $num . '<br>';
	}
    echo $count . ' количество итераций';
?> -->

<!-- Решите предыдущую задачу через цикл for.
<?php
    for ($num = 100, $i = 0; $num < 1000; $num *= 3, $i++);
    echo $i . ' количество итераций';
?> -->